perf-tests/mongo-perf/local/dLoad
mongo client connection created with mongodb://10.0.4.15:27017
[OVERALL], RunTime(ms), 8449
[OVERALL], Throughput(ops/sec), 591.7860101787194
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 26
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3077287252929341
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 26
[TOTAL_GC_TIME_%], Time(%), 0.3077287252929341
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3547.0
[CLEANUP], MinLatency(us), 3546
[CLEANUP], MaxLatency(us), 3547
[CLEANUP], 95thPercentileLatency(us), 3547
[CLEANUP], 99thPercentileLatency(us), 3547
[INSERT], Operations, 5000
[INSERT], AverageLatency(us), 578.9228
[INSERT], MinLatency(us), 314
[INSERT], MaxLatency(us), 467967
[INSERT], 95thPercentileLatency(us), 842
[INSERT], 99thPercentileLatency(us), 1262
[INSERT], Return=OK, 5000